# Варіант 11
x=c(1,3,6,8,9,10,11,12,14,16,17,18,20,22,23,24,25,27,29,30)
y=c(-26,-18,-6,2,6,10,14,18,26,34,38,42,50,58,62,66,70,78,86,90)

# Для заданої таблиці даних обчислити коефіцієнти кореляції та
# зробити висновок про тісноту зв’язку між параметрами x та y згідно
# варіанта.

# Коефіцієнт лінійної кореляції Пірсона
n <- length(x)
x_mean <- mean(x)
y_mean <- mean(y)
r <- sum((x-x_mean)*(y-y_mean)) / sqrt(sum((x - x_mean)^2) * sum((y - y_mean)^2))
print(r)
r_corrected <- r * (1 + ((1 - r^2)/(2*(n-3))))
print(r_corrected)

r_lib = cor(x,y)
print(r_lib)
cor.test(x,y)

# Коефіцієнт рангової кореляції Спірмена
rs = 1 - (6 * sum((x-y)^2) / (n^3 - n))
print(rs)

